[
    {
        "name": "Seated Cat-Cow Stretch",
        "description": "A seated version of the Cat-Cow stretch, performed on a chair.",
        "benefits": "Increases flexibility of the spine, improves posture and balance.",
        "youtube_link": "https://www.youtube.com/watch?v=iPlNl2wY3ro"
    },
    {
        "name": "Seated Forward Fold Pose On Chair",
        "description": "The Seated Forward Fold Pose on Chair is a gentle yoga posture that involves sitting on a chair and bending forward to reach towards the feet or the floor. This pose helps to stretch the back, shoulders, and legs, promoting relaxation and flexibility.",
        "benefits": "Stretches the spine, shoulders, and hamstrings. Helps to calm the mind and relieve stress. Improves digestion by stimulating abdominal organs. Enhances flexibility in the back and legs. Can be beneficial for people with limited mobility or those who find traditional forward folds challenging.",
        "youtube_link": "https://www.youtube.com/watch?v=UeGx--3Qr3s"
    },
    {
        "name": "Downward Facing Dog Pose Variation Both Knees Bent Chair",
        "description": "The Downward Facing Dog Pose Variation Both Knees Bent on Chair is a modified version of the traditional Downward Facing Dog Pose, performed with the support of a chair. This variation involves bending both knees while keeping the hands on the chair, providing a gentle stretch to the back and legs.",
        "benefits": "Stretches the back, shoulders, and hamstrings. Helps to relieve tension and stress. Improves posture and alignment. Enhances flexibility and strength in the upper body and legs. Suitable for individuals with limited mobility or those who find the traditional Downward Facing Dog Pose challenging.",
        "youtube_link": "https://www.youtube.com/watch?v=OtlHatCn8c4"
    },
    {
        "name": "Chair Seated Side Stretch Pose",
        "description": "The Chair Seated Side Stretch Pose is a gentle yoga posture performed while seated on a chair. It involves reaching one arm overhead and bending sideways to stretch the side body, including the obliques and intercostal muscles.",
        "benefits": "Stretches the side body, improves flexibility, enhances spinal mobility, and helps to release tension in the shoulders and back.",
        "youtube_link": "https://www.youtube.com/watch?v=AsL4WMtHSpU"
    },
    {
        "name": "Chair Seated Twists",
        "description": "Chair Seated Twists involve sitting upright on a chair with feet flat on the floor, and gently twisting the torso to one side while holding the back of the chair for support. This twist is repeated on the opposite side.",
        "benefits": "Improves spinal mobility, aids in digestion, reduces back pain, and releases tension in the lower back and shoulders.",
        "youtube_link": "https://www.youtube.com/watch?v=HwAkRrqbXo8"
    },
    {
        "name": "Chair Seated Twist Pose",
        "description": "Chair Seated Twist Pose involves sitting upright on a chair with feet flat on the floor, and gently twisting the torso to one side while holding the back of the chair for support. This twist is repeated on the opposite side.",
        "benefits": "Improves spinal mobility, aids in digestion, reduces back pain, and releases tension in the lower back and shoulders.",
        "youtube_link": "https://www.youtube.com/watch?v=Zk1davrpYc8"
    },
    {
        "name": "Chair Cat Cow Pose",
        "description": "Chair Cat Cow Pose involves sitting on a chair with feet flat on the floor. The pose consists of alternating between arching the back and lifting the chest (Cow Pose) and rounding the spine and tucking the chin (Cat Pose).",
        "benefits": "Increases flexibility of the spine, improves posture, and helps relieve tension in the neck and shoulders.",
        "youtube_link": "https://www.youtube.com/watch?v=LEEOIXG3Co0"
    },
    {
        "name": "Chair Neck Stretch",
        "description": "Chair Neck Stretch involves sitting upright on a chair with feet flat on the floor, gently tilting the head to one side to stretch the neck muscles, and holding the position before repeating on the other side.",
        "benefits": "Relieves tension in the neck and shoulders, increases flexibility, and improves posture.",
        "youtube_link": "https://www.youtube.com/watch?v=mS4S6kos8MM"
    },
    {
        "name": "Heel Raises Chair",
        "description": "Heel Raises Chair involves sitting on a chair with feet flat on the floor, then lifting the heels while keeping the toes on the ground, and lowering them back down.",
        "benefits": "Strengthens the calves, improves balance, and enhances circulation in the legs.",
        "youtube_link": "https://www.youtube.com/watch?v=fbqEjN9pyxI"
    },
    {
        "name": "Beginner Tree Pose Chair",
        "description": "Beginner Tree Pose Chair involves sitting on a chair, placing one foot on the inner thigh or calf of the opposite leg, and bringing the palms together in front of the chest.",
        "benefits": "Improves balance, strengthens the legs, and enhances concentration.",
        "youtube_link": "https://www.youtube.com/watch?v=SxqDae7lpNc"
    }
]